<a href="https://colab.research.google.com/github/FloxTBoTyy/Mi-primer-repository/blob/main/jupyter_labs_eda_sql_coursera_sqllite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2023-01-01">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.


Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid\ofertar\ against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [2]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.0/6.0 MB 4.9 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp310-cp310-linux_x86_64.whl size=1207942 sha256=749bf8709c7f10d47dbbc3b5186d8e1f63321fe2f7e2f479c90bb3880248920e
  Stored in directory: /root/.cache/pip/wheels/8b/6d/9c/e1793e5a2d85b89b8c362a4f0e3def54b786bcd14923b9ff00
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.16
    Uninstalling SQLAlchemy-2.0.16:
      Successfully uninstalled SQLAlchemy-2.0.16
Successfully installed sqlalchemy-1.3.9

In [ ]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (2.0.16)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (4.6.3)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy) (2.0.2)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [3]:
%load_ext sql

In [4]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
%pwd #To see the current directory

'/content'

In [6]:
%sql sqlite:///my_data1.db

In [7]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")
# Save the data from the DataFrame 'df' to a table named 'SPACEXTBL' in an SQL database
# Parameters:
#    - "SPACEXTBL": Name of the table where the data will be saved.
#    - con: Connection object to the SQL database.
#    - if_exists='replace': If the table 'SPACEXTBL' already exists, it will be replaced.
#    - index=False: The DataFrame's indices will not be included in the SQL table.
#    - method="multi": Method used to insert the data into the table.

999

In [8]:
%%sql
SELECT * FROM SPACEXTBL
LIMIT 10;

 * sqlite:///my_data1.db
Done.

[('06/04/2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('12/08/2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22/05/2012', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('10/08/2012', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('03/01/2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('29/09/2013', '16:00:00', 'F9 v1.1  B1003', 'VAFB SLC-4E', 'CASSIOPE', 500.0, 'Polar LEO', 'MDA', 'Success', 'Uncontrolled (ocean)'),
 ('12/03/2013', '22:41:00', 'F9 v1.1', 'CCAFS LC-40', 'SES-8', 3170.0, 'GTO', 'SES', 'Success', 'No attempt'),
 ('01/06/2014', '22:06:00', 'F9 v1.1', 'CCAFS LC-40', 'Thaicom 6', 3325.0, 'GTO', 'Thaicom', 'Success', 'No attempt'),
 ('18/04/2014', '19:25:00', 'F9 v1.1', 'CCAFS LC-40', 'SpaceX CRS-3', 2296.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Controlled (ocean)'),
 ('14/07/2014', '15:15:00', 'F9 v1.1', 'CCAFS LC-40', 'OG2 Mission 1  6 Orbcomm-OG2 satellites', 1316.0, 'LEO', 'Orbcomm', 'Success', 'Controlled (ocean)')]

In [9]:
%%sql
PRAGMA table_info(SPACEXTBL);

 * sqlite:///my_data1.db
Done.

[(0, 'Date', 'TEXT', 0, None, 0),
 (1, 'Time (UTC)', 'TEXT', 0, None, 0),
 (2, 'Booster_Version', 'TEXT', 0, None, 0),
 (3, 'Launch_Site', 'TEXT', 0, None, 0),
 (4, 'Payload', 'TEXT', 0, None, 0),
 (5, 'PAYLOAD_MASS__KG_', 'REAL', 0, None, 0),
 (6, 'Orbit', 'TEXT', 0, None, 0),
 (7, 'Customer', 'TEXT', 0, None, 0),
 (8, 'Mission_Outcome', 'TEXT', 0, None, 0),
 (9, 'Landing_Outcome', 'TEXT', 0, None, 0)]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [10]:
%%sql
SELECT DISTINCT "Launch_Site" FROM SPACEXTBL
ORDER BY "Launch_Site";

 * sqlite:///my_data1.db
Done.

[(None,),
 ('CCAFS LC-40',),
 ('CCAFS SLC-40',),
 ('KSC LC-39A',),
 ('VAFB SLC-4E',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [11]:
%%sql
SELECT * FROM SPACEXTBL
WHERE "LaunchSite" LIKE 'CCA%'
LIMIT 5;

 * sqlite:///my_data1.db
Done.

[]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [12]:
%%sql
SELECT "Customer", SUM(PAYLOAD_MASS__KG_) AS TOTAL_MASS FROM SPACEXTBL
GROUP BY "Customer"
HAVING "Customer"="NASA (CRS)";

 * sqlite:///my_data1.db
Done.

[('NASA (CRS)', 45596.0)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [13]:
%%sql

SELECT "Booster_Version", AVG(PAYLOAD_MASS__KG_) FROM SPACEXTBL
WHERE "Booster_Version"= "F9 v1.1";

 * sqlite:///my_data1.db
Done.

[('F9 v1.1', 2928.4)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [14]:
%%sql
select distinct("Landing_Outcome") from SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',),
 (None,)]

In [15]:
%%sql
SELECT "Date", "Landing_Outcome" FROM SPACEXTBL
WHERE "Landing_Outcome"="Success (ground pad)"
LIMIT 1;

 * sqlite:///my_data1.db
Done.

[('22/12/2015', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [30]:
%%sql
select "Landing_Outcome", "Booster_Version", "PAYLOAD_MASS__KG_" from SPACEXTBL
where ("Landing_Outcome" = "Success (drone ship)")
and ("PAYLOAD_MASS__KG_" between 4000 and 6000  )

 * sqlite:///my_data1.db
Done.

[('Success (drone ship)', 'F9 FT B1022', 4696.0),
 ('Success (drone ship)', 'F9 FT B1026', 4600.0),
 ('Success (drone ship)', 'F9 FT  B1021.2', 5300.0),
 ('Success (drone ship)', 'F9 FT  B1031.2', 5200.0)]

In [32]:
%%sql
select "Booster_Version" from SPACEXTBL
where ("Landing_Outcome" = "Success (drone ship)")
and ("PAYLOAD_MASS__KG_" between 4000 and 6000)

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [62]:
%%sql

select   "Mission_Outcome",COUNT("Mission_Outcome") as "Total" from SPACEXTBL
where "Mission_Outcome" <> "None"
group by "Mission_Outcome" = "Failure (in flight)"

 * sqlite:///my_data1.db
Done.

[('Success', 100), ('Failure (in flight)', 1)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [98]:
%%sql
-- Using sub-querys whithout knowing the max value of total
SELECT "Booster_Version", Total
FROM (
    SELECT "Booster_Version", SUM("PAYLOAD_MASS__KG_") AS Total
    FROM SPACEXTBL
    GROUP BY "Booster_Version"
) AS subquery
WHERE Total = (select max(Total) as "Total Max" from (select "Booster_Version",sum("PAYLOAD_MASS__KG_") as Total from SPACEXTBL
group by "Booster_Version"
order by Total desc) as subquery2)
ORDER BY Total DESC;

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600.0),
 ('F9 B5 B1048.5', 15600.0),
 ('F9 B5 B1049.4', 15600.0),
 ('F9 B5 B1049.5', 15600.0),
 ('F9 B5 B1049.7 ', 15600.0),
 ('F9 B5 B1051.3', 15600.0),
 ('F9 B5 B1051.4', 15600.0),
 ('F9 B5 B1051.6', 15600.0),
 ('F9 B5 B1056.4', 15600.0),
 ('F9 B5 B1058.3 ', 15600.0),
 ('F9 B5 B1060.2 ', 15600.0),
 ('F9 B5 B1060.3', 15600.0)]

In [89]:
%%sql
-- Using sub-querys with having whithout knowing tha max value of total
select "Booster_Version", sum("PAYLOAD_MASS__KG_") as Total from SPACEXTBL
group by "Booster_Version"
having Total =(select max(Total) as "Total Max"
               from (select "Booster_Version",sum("PAYLOAD_MASS__KG_") as Total
                    from SPACEXTBL
                    group by "Booster_Version"
                    order by Total desc) as subquery)
order by Total desc;

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1060.3', 15600.0),
 ('F9 B5 B1060.2 ', 15600.0),
 ('F9 B5 B1058.3 ', 15600.0),
 ('F9 B5 B1056.4', 15600.0),
 ('F9 B5 B1051.6', 15600.0),
 ('F9 B5 B1051.4', 15600.0),
 ('F9 B5 B1051.3', 15600.0),
 ('F9 B5 B1049.7 ', 15600.0),
 ('F9 B5 B1049.5', 15600.0),
 ('F9 B5 B1049.4', 15600.0),
 ('F9 B5 B1048.5', 15600.0),
 ('F9 B5 B1048.4', 15600.0)]

In [94]:
%%sql
-- query to obtain the max value of total that would be replace whithin other querys
select max(Total) as "Total Max" from (select "Booster_Version",sum("PAYLOAD_MASS__KG_") as Total from SPACEXTBL
group by "Booster_Version"
order by Total desc) as subquery

 * sqlite:///my_data1.db
Done.

[(15600.0,)]

Both have the same result

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [107]:
%%sql

SELECT
    CASE
        WHEN substr(Date, 4, 2) = '01' THEN 'January'
        WHEN substr(Date, 4, 2) = '02' THEN 'February'
        WHEN substr(Date, 4, 2) = '03' THEN 'March'
        WHEN substr(Date, 4, 2) = '04' THEN 'April'
        WHEN substr(Date, 4, 2) = '05' THEN 'May'
        WHEN substr(Date, 4, 2) = '06' THEN 'June'
        WHEN substr(Date, 4, 2) = '07' THEN 'July'
        WHEN substr(Date, 4, 2) = '08' THEN 'August'
        WHEN substr(Date, 4, 2) = '09' THEN 'September'
        WHEN substr(Date, 4, 2) = '10' THEN 'October'
        WHEN substr(Date, 4, 2) = '11' THEN 'November'
        WHEN substr(Date, 4, 2) = '12' THEN 'December'
        ELSE 'Unknown'
    END AS Month,
    CASE
        WHEN substr(Date, 7, 4) = '2015' THEN '2015'
        ELSE 'Unknown'
        END AS Year,
        Landing_Outcome,
        Booster_Version,
        Launch_Site
FROM SPACEXTBL
WHERE substr(Date, 7, 4) = '2015' AND Landing_Outcome = 'Failure (drone ship)';

 * sqlite:///my_data1.db
Done.

[('October', '2015', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('April', '2015', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [109]:
%%sql
SELECT Date,
       "Landing_Outcome",
       COUNT(*) AS "Count"
FROM SPACEXTBL
WHERE substr(Date, 7, 4) || substr(Date, 1, 2) || substr(Date, 4, 2) >= '20100604'
  AND substr(Date, 7, 4) || substr(Date, 1, 2) || substr(Date, 4, 2) <= '20170320'
GROUP BY "Landing_Outcome"
ORDER BY COUNT(*) DESC;

 * sqlite:///my_data1.db
Done.

[('22/05/2012', 'No attempt', 9),
 ('01/10/2015', 'Failure (drone ship)', 5),
 ('04/08/2016', 'Success (drone ship)', 4),
 ('18/04/2014', 'Controlled (ocean)', 3),
 ('29/09/2013', 'Uncontrolled (ocean)', 2),
 ('22/12/2015', 'Success (ground pad)', 2),
 ('06/04/2010', 'Failure (parachute)', 2),
 ('28/06/2015', 'Precluded (drone ship)', 1)]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>